[
  {
    "username": "the_intuition_dietitian",
    "comment": "the_intuition_dietitian Verified 23hI’ll start: Reminders on my phone never work for me because I’ll just ignore them, so instead I just put something out of place in the area that I will reminded about the task and when I’m like what the fuck why is this piece of paper here? I’m like oh yeah it’s cause I need to make my dentist appointment. 😂😂Pls i need to hear yalls",
    "timestamp": "2025-04-03T17:27:48.000Z",
    "likes": "0",
    "verified": true
  },
  {
    "username": "sophibay",
    "comment": "i always “start the robots first” when i clean. so laundry goes in, dishwasher gets loaded and started, if i had a roomba it would go on, etc. then i start cleaning. it’s very motivating knowing my droids are cleaning along with me lol",
    "timestamp": "2025-04-04T04:44:15.000Z",
    "likes": "5,857",
    "verified": false
  },
  {
    "username": "megingraham",
    "comment": "I wrote my doctoral dissertation by physically tying myself to the desk, because it was just funny enough in my own head to make the experience interesting",
    "timestamp": "2025-04-03T18:11:14.000Z",
    "likes": "6,908",
    "verified": false
  },
  {
    "username": "windykmarie",
    "comment": "I make my lunch for work a lot and I used to forget it in the fridge at home or I would forget the lunchbox at work so upon the suggestion of my mom I now put my car keys in the fridge with my lunchbox so i remember to take it with me lol",
    "timestamp": "2025-04-03T17:42:28.000Z",
    "likes": "4,459",
    "verified": false
  },
  {
    "username": "jessie.canary",
    "comment": "If I'm feeling frozen about doing something I don't want to do, I'll tell myself, \"I'm going to count to ten AS SLOWLY AS I WANT and then, when I hit 10, I'll do the Thing.\" Usually about halfway through, I get bored/tired of my own shit, rush through the last few numbers, and do it. 😂",
    "timestamp": "2025-04-03T17:53:00.000Z",
    "likes": "3,500",
    "verified": false
  },
  {
    "username": "salted.granola.girl",
    "comment": "Idk if this is gamifying but I like to listen to the sims 2 soundtrack while I do anything I hate doing. And pretend I'm a sim with tasks. Hope this helps someone haha",
    "timestamp": "2025-04-03T18:19:54.000Z",
    "likes": "1,311",
    "verified": false
  },
  {
    "username": "sydthedietitian",
    "comment": "One of my clients would put a protein bar on their doorframe as part of their bedtime routine so that when they left for work in the morning it would fall on them and they would remember to eat it 😅",
    "timestamp": "2025-04-03T19:12:35.000Z",
    "likes": "2,916",
    "verified": false
  },
  {
    "username": "allsidesofev",
    "comment": "Suddenly feeling the need to type these all out in a Google doc and keep it as a live doc to access rather than coming back and losing my place in the comments cuz there are so many funny and good ideas!",
    "timestamp": "2025-04-03T20:26:54.000Z",
    "likes": "411",
    "verified": false
  },
  {
    "username": "whoinvitedaliciaa",
    "comment": "I do things I hate while sitting on the floor. Folding laundry and going through the mail pile are my least favorite, and happen on the floor so that it takes more effort to wander away and I would be bothered by the mess if I left it there.",
    "timestamp": "2025-04-03T17:45:18.000Z",
    "likes": "5,769",
    "verified": false
  },
  {
    "username": "lea.harlev",
    "comment": "don’t sit down or pee once you get home from work until all of the annoying little tasks are done, also listening to a podcast or a long album on the drive home and continuing to listen to it with headphones as you transition from the car to house and while you do all the annoying little tasks until you are too, helps ease transitions being hard for me at least",
    "timestamp": "2025-04-03T18:24:28.000Z",
    "likes": "1,470",
    "verified": false
  },
  {
    "username": "sasha.mlowell",
    "comment": "I turn on Great British Baking Show while I fold laundry and pretend that the time calls for the challenges apply to my laundry pile",
    "timestamp": "2025-04-04T13:14:58.000Z",
    "likes": "115",
    "verified": false
  },
  {
    "username": "hjhumphrey",
    "comment": "When i have a chunk of time that i need to get several things done in I write down all the tasks on slips of paper and add in a few tasks i enjoy doing (30 min of sewing, 10 min scrolling tiktok) and then i draw the slips at random and then i have to do whatever i draw out of the hat 🤷🏻‍♀️",
    "timestamp": "2025-04-03T18:16:21.000Z",
    "likes": "771",
    "verified": false
  },
  {
    "username": "_miss_mayhem",
    "comment": "I do \"dirty\" chores like cleaning the bathroom, dishes, taking out the garbage while I'm still all gross after my workout and then shower. I tell myself might as well do the dirty things while I'm dirty",
    "timestamp": "2025-04-03T21:01:20.000Z",
    "likes": "4,654",
    "verified": false
  },
  {
    "username": "x_tomini_x",
    "comment": "If I dont feel tired I will do a 24hr challenge staying awake. I will spend the night doing chores to trick my brain into being awake. Blasting music hleps. Then I go gym at like 5am for an hr or 2. Then I mealprep since its still morning and get it all done so I dont cook for the day. Work and study most of the day, maybe a walk. Then i just doomscroll and since I did so much, I interpret the doomscroll as a reward then passout for 10hrs. It helps reset me all though I am sore and lowkey delirious the whole day",
    "timestamp": "2025-04-04T13:01:18.000Z",
    "likes": "15",
    "verified": false
  },
  {
    "username": "srirachagrace",
    "comment": "I have to say “let’s go girls” to switch to a non preferred activity",
    "timestamp": "2025-04-03T19:31:30.000Z",
    "likes": "2,903",
    "verified": false
  },
  {
    "username": "magpiesoddities",
    "comment": "Go to that random wheel generator thing online, Enter in everything you're supposed to do that day or that week, push the random spin and that's what you got to do before you can move on to any of the others. Also enter fun things like going to get coffee or taking an hour to watch your favorite show so that it's like a gamble for a good things or work things and makes your brain go tingle",
    "timestamp": 1743774219,
    "likes": 118,
    "verified": false
  },
  {
    "username": "distaaybled",
    "comment": "When I’m struggling with executive dysfunction I sing the Hannah Montana transition tune SO loud it forces me to transition to my next thing",
    "timestamp": 1743704127,
    "likes": 413,
    "verified": false
  },
  {
    "username": "fawnshea_ttv",
    "comment": "I keep my shoes on when i get home to stay motivated to cook dinner. I have no idea what happens when i take off my shoes but it’s been working for me lately",
    "timestamp": 1743704754,
    "likes": 160,
    "verified": false
  },
  {
    "username": "indigocloward",
    "comment": "this comment section about to do more for me than any therapist ever has.\nidk if mine is necessarily helpful so use with caution.. but i set all of my clocks besides my phone like 2-5 minutes fast so it gaslights me into urgency mode😭😭",
    "timestamp": 1743707099,
    "likes": 1689,
    "verified": false
  },
  {
    "username": "ra_ble72",
    "comment": "I gave up my career and quit my 8-5 office job that was forcing me to medicate in order to function within its perimeters and went to multiple part time gigs now instead that flex varied skills so my ADHD can live uncaged instead of fighting it into submission. 🙈 🤷‍♀️ I know it’s not for everyone but if you can, I highly recommend it!",
    "timestamp": 1743704011,
    "likes": 136,
    "verified": false
  },
  {
    "username": "mmaggiehigh",
    "comment": "I wait till my computer is at 10% and then do as much work as I can before it gets to 2%, I call it beat the battery and the urgency drive of it “dying” helps me",
    "timestamp": 1743706356,
    "likes": 1054,
    "verified": false
  },
  {
    "username": "sweet_emu_sees",
    "comment": "I joined a 2nd book club despite only being able to read 5/12 books in the first one.  Now I have an \"upstairs book\" and a \"downstairs book\" to pick up when im bored instead of my phone. So far I've read both books each month.",
    "timestamp": 1743703525,
    "likes": 847,
    "verified": false
  },
  {
    "username": "estaeslacuentadeleo",
    "comment": "whenever i feel frozen trying to do a task and i just can’t get my brain in gear i try to do some sort of physical activity that is hard but for less than a minute, handstands work best but sometimes jumping jacks or just anything that gets the flood going",
    "timestamp": 1743703550,
    "likes": 62,
    "verified": false
  },
  {
    "username": "theamazingalejandra",
    "comment": "I tell myself I will do dishes only for as long as something is in the air fryer or load of laundry at a time so I feel like I have a challenge/makes things more interesting and then end up doing all the dishes at once anyway cus I'm already there",
    "timestamp": 1743769119,
    "likes": 23,
    "verified": false
  },
  {
    "username": "caithopehiggins",
    "comment": "Omg no wonder why all my phone reminders go ignored",
    "timestamp": 1743702347,
    "likes": 20,
    "verified": false
  },
  {
    "username": "chubrubclothing",
    "comment": "When I have to do tasks I don't enjoy, I pretend to be the host of a how-to show teaching an audience. I started doing it as a kid to deal with how boring showers were 😂",
    "timestamp": 1743743352,
    "likes": 681,
    "verified": false
  },
  {
    "username": "alienwithgreeneyes",
    "comment": "I pretend I’m another person; as if I’m being filmed, i try to slow down and do every activity like it’s the opening credits of an early 2000’s movie and I’m just a cute *quirky* girl that’s going about her day.",
    "timestamp": 1743742082,
    "likes": 240,
    "verified": false
  },
  {
    "username": "alyrweb",
    "comment": "I make a ton of to-do lists and put regular everyday things and stuff I’ve already done on there as a reward 😂",
    "timestamp": 1743748112,
    "likes": 28,
    "verified": false
  },
  {
    "username": "mollsink",
    "comment": "I shower with the lights off. May sound silly but it makes it a much better and easier experience for me",
    "timestamp": 1743710477,
    "likes": 178,
    "verified": false
  },
  {
    "username": "giftofgritcounseling",
    "comment": "I play walk out songs (like in baseball) to get myself moving in the direction of the thing I’m avoiding. Right now, it’s “We Ready” by Archie Eversole 😂",
    "timestamp": 1743706654,
    "likes": 50,
    "verified": false
  },
  {
    "username": "sozzij",
    "comment": "Instead of setting reminders I schedule texts to myself bc then they don’t go away if I miss the reminder, can’t do it in that moment, or accidentally snooze it or whatever. I can keep the notification there until it is done and it surprises me every time I pick up my phone, I am like “ooh a text” and it’s just “call the Drs”",
    "timestamp": 1743714300,
    "likes": 338,
    "verified": false
  },
  {
    "username": "kristafirwalkin",
    "comment": "I unload and reload half of the dishwasher because I know once it's at that point I won't be able to tolerate it being half dirty/half clean and will empty the rest",
    "timestamp": 1743723025,
    "likes": 75,
    "verified": false
  },
  {
    "username": "kactus.everrrgreen",
    "comment": "I treat myself like a tamagotchi and it helps my executive dysfunction if I'm not connected to the choices",
    "timestamp": 1743706970,
    "likes": 62,
    "verified": false
  },
  {
    "username": "lipstcklullabies",
    "comment": "I put my pills in an ashtray and call it my candy jar to make it fun and actually want to take them",
    "timestamp": 1743748406,
    "likes": 11,
    "verified": false
  },
  {
    "username": "tantrumatteatime",
    "comment": "Stopping to do little random tasks in the middle of big tasks (watering my plants during work hours) helps me stay on task 😂 so essentially, getting a little off task helps keep me on task for the bigger picture",
    "timestamp": 1743703702,
    "likes": 28,
    "verified": false
  },
  {
    "username": "malecto",
    "comment": "I pretend I'm a cleaning influencer and I narrate my \"videos\" while I'm cleaning... Don't want to bore my followers with a long video, the algorithm won't like that. I'll get hate in the comments if I don't clean the kitchen fully and well and that just won't do",
    "timestamp": 1743747473,
    "likes": 59,
    "verified": false
  },
  {
    "username": "kristafirwalkin",
    "comment": "Oh and I treat myself like a sims character. If I'm feeling wack I go through the list of sims needs to consider what it is I need.",
    "timestamp": 1743723213,
    "likes": 37,
    "verified": false
  },
  {
    "username": "_._berk_._",
    "comment": "I'm chronically late to everything and used to save my appointments in my phone as a few minutes early but then I started factoring that time in and still being late to stuff so now I put about half of my appointments in my phone 10 minutes early so I can never guess what ones I'm allowed to be late to and I'm forgetful enough that it works perfectly 😂",
    "timestamp": 1743783997,
    "likes": 3,
    "verified": false
  },
  {
    "username": "midnight_messages13",
    "comment": "When I clean I make piles for rooms (not the doom piles) and if I get bored in one room I grab a pile from that room and move to another room based on the pile I grabbed… like if I am in the living room cleaning and I’m getting sick of that space I’ll grab a pile of STPA=Shit To Put Away in another room like my bedroom and I’ll go up there and put the STPA pile away and sort out some of my room… get bored and move to the bathroom with another STPA pile… this keeps going unntil I’m either exhausted from going up and down the stairs 50 times a day or everything gets put away… sometimes STPA piles just keep spawning because if im not focused on putting it away I leave it where it lay lol",
    "timestamp": 1743724397,
    "likes": 32,
    "verified": false
  },
  {
    "username": "corvus.starboy",
    "comment": "A boring thing you dont wanna do? Do it novel. Do it in the bath, in a cafe, in a library, in a park, in a fuckin tree, in full cosplay or the most expensive/fun fit you have, wear an apron, on a swing set or a kiddie pool in ur backyard who CARES. Also, keep ur shoes on when you get home. Do not allow yourself to take them off and rest until you have finished whatevers still important before you mentally clock off entirely. Dishes, making dinner, cleaning, getting things packed for work the next day, tidying up, whatever. Shoes on = I Still Need To Do Things Mode",
    "timestamp": 1743740734,
    "likes": 64,
    "verified": false
  },
  {
    "username": "renaissancehealing_",
    "comment": "I always have an exit or an out of some sort. I trick my brain into thinking it will always have a way to run and then usually it decides it wants to commit to whatever chore I end up doing (but only as long as it knows there’s a way out of it)",
    "timestamp": 1743703361,
    "likes": 57,
    "verified": false
  },
  {
    "username": "platonictouch",
    "comment": "If I need to remember to take something with me the next day, I’ll put it on top of my keys or inside my shoes",
    "timestamp": 1743702084,
    "likes": 91,
    "verified": false
  },
  {
    "username": "saaaaaaaahhdude",
    "comment": "I listen to Mario kart final lap music when I’m trying to get office work done that I find boring",
    "timestamp": 1743779185,
    "likes": 2,
    "verified": false
  },
  {
    "username": "theshabbycreekcottage",
    "comment": "Bergamot oil on my wrists and a clear quartz tucked in my bra ✨",
    "timestamp": 1743779347,
    "likes": 7,
    "verified": true
  },
  {
    "username": "madelinehixon",
    "comment": "i facetime my friends when ive been procrastinating a task bc when im on the phone with them i dont want to seem lazy so i will start the tasks ive been dreading & do them while on the phone!",
    "timestamp": 1743773827,
    "likes": 14,
    "verified": false
  },
  {
    "username": "aliciacreti",
    "comment": "I make dinner and dont eat it until i cleaned the entire apartment. That shit goes in the microwave at least 3 times so i make my pasta sauce extra creamy",
    "timestamp": 1743757024,
    "likes": 35,
    "verified": true
  },
  {
    "username": "liz.s.delcarmen",
    "comment": "If I need to take something with me when I leave the next day I’ll make a HUGE sign and tape it *across* the seam of the from door with masking tape or duct tape, right at eye level. So that I have to spend several moments breaking the seal I’ve created on the door, I can’t just breeze past it like I could a post it note or something.",
    "timestamp": 1743783271,
    "likes": 2,
    "verified": false
  },
  {
    "username": "howthheck",
    "comment": "I will delay enjoyable or rewarding things as long as possible in order to get more of the not enjoyable or less rewarding things done. I get an hour lunch at work and can choose when I take it, and I regularly will work 5-6 hours before taking my lunch because it means I only have 2-3 hours left when I get back. When I was in school I'd write entire papers in one day, sometimes one sitting if I had the time to. I'll do as many chores as possible before taking a break to do something I like. Basically if I can get it out of the way all in one go I will",
    "timestamp": 1743783733,
    "likes": 0,
    "verified": false
  },
  {
    "username": "cmontondon",
    "comment": "Audiobooks have changed my ability to clean, cook and tackle longer projects",
    "timestamp": 1743736229,
    "likes": 15,
    "verified": false
  },
  {
    "username": "ninon_ringenbach",
    "comment": "I’m writing everything down",
    "timestamp": 1743783533,
    "likes": 2,
    "verified": false
  },
  {
    "username": "donu.ts",
    "comment": "Mini ice cream cone before breakfast. I wake up and I think “if I get out of bed right now I can eat an ice cream cone” then I’m up!",
    "timestamp": 1743732838,
    "likes": 210,
    "verified": false
  },
  {
    "username": "tindertranslators",
    "comment": "Choose shoes you don't need to wear socks with so that you can avoid washing/drying/putting away socks AND having to find socks and put them on before you go out 😂",
    "timestamp": 1743776826,
    "likes": 9,
    "verified": true
  },
  {
    "username": "fork.diet.culture",
    "comment": "I LOVE THIS COMMENT SECTION",
    "timestamp": 1743782480,
    "likes": 6,
    "verified": false
  },
  {
    "username": "jolenekellough",
    "comment": "Piles. Start in a room that needs to be tidied. Bins or boxes or a laundry basket will be your friend for this. Start with collecting trash. Now anything that belongs not in that room, goes into a bin. You can have a bin for each room that you just drop shit into as you clean, then you’re only making one trip across the house to the other rooms, ergo, less chance for distracting side quests",
    "timestamp": 1743783158,
    "likes": 1,
    "verified": false
  },
  {
    "username": "hiyo_im_milo",
    "comment": "i turn on the big light in every room when i clean. i only get to turn off the big light when i finish that room. if i get distracted and walk away from the room that I'm on I'll notice the big light and get back on task. also keeping your shoes on (even just my socks works for me) while you want to get shii done so you dont get too comfy",
    "timestamp": 1743714345,
    "likes": 418,
    "verified": false
  },
  {
    "username": "como.la.miel",
    "comment": "I leave lights on so I will notice it later and then ask myself why I would leave a light on. I move from kitchen to living room to my room at night to “close up” before going to sleep and turn off each light to know I did everything I needed to to leave that room",
    "timestamp": 1743739667,
    "likes": 32,
    "verified": false
  },
  {
    "username": "er_there4you",
    "comment": "Brush your teeth before going in the shower, then you can climb right into bed! Or tape your refrigerator closed so you remember to take food out of your freezer for dinner",
    "timestamp": 1743771391,
    "likes": 1,
    "verified": false
  },
  {
    "username": "orionjackell",
    "comment": "I used to get annoyed that every time I took out the trash I would forget to put a new bag in, so I would continue using the same bag until it filled up an ungodly amount, also I always take out the trash as I’m on my way out to work and would be running late so no time to replace the bag \nI decided to just line the trash can with multiple bags so every time I get back home I have no trash and a trash can thats ready to use because it already has a bag",
    "timestamp": 1743775753,
    "likes": 7,
    "verified": false
  },
  {
    "username": "ellie_brooks27",
    "comment": "have 3 different stimulations going while you're doing something you hate like folding laundry or cleaning. music+movie+show+people talking",
    "timestamp": 1743776517,
    "likes": 7,
    "verified": false
  },
  {
    "username": "akatix",
    "comment": "I explain the task as I do it to my cats 🫣 one, they're always shadowing me anyways, and two - if I'm talking about the thing as I do the thing my brain must think about the thing",
    "timestamp": 1743783360,
    "likes": 0,
    "verified": false
  }
]